Repository: zeightOFFICIAL/portrait-manager
Catalog: properties/TextVariables.*.resx
Languages: de, ru

# BUTTON_ADVANCED
source: Change medium
de: Mittleres Porträt
ru: Средний портрет

# BUTTON_ADVANCED2
source: Change small
de: Kleines Porträt
ru: Малый портрет

# BUTTON_APPLY
source: Apply
de: Anwenden
ru: Применить

# BUTTON_BACK
source: Back
de: Zurück
ru: Назад

# BUTTON_CANCEL
source: Cancel
de: Stornieren
ru: Отменить

# BUTTON_CUSTOMARMY
source: Show custom army
de: Armeen
ru: Армии

# BUTTON_CUSTOMNPC
source: Show custom NPC
de: Figuren
ru: Персонажи

# BUTTON_EXIT
source: Exit
de: Hinausgehen
ru: Выйти

# BUTTON_EXTRACTALL
source: Extract all
de: Alle verschieben
ru: Переместить все

# BUTTON_EXTRACTOPENFOLDER
source: Open folders
de: Ordner öffnen
ru: Открыть папки

# BUTTON_EXTRACTSELECTED
source: Extract selected
de: Bewegen
ru: Переместить

# BUTTON_FINALOPENFOLDER
source: Open
de: Offen
ru: Открыть

# BUTTON_GALLERYOPENFOLDER
source: Open folder
de: Ordner öffnen
ru: Открыть папку

# BUTTON_LOAD
source: Load
de: Herunterladen
ru: Загрузить

# BUTTON_LOADLOCALPORTRAIT
source: Choose local
de: Wählen
ru: Выбрать

# BUTTON_LOADWEBPORTRAIT
source: Choose web
de: Herunterladen
ru: Загрузить

# BUTTON_MENU
source: Menu
de: Hauptmenü
ru: Меню

# BUTTON_NEW
source: New
de: Erstellen
ru: Создать

# BUTTON_NO
source: No
de: Nein
ru: Нет

# BUTTON_OK
source: Ok
ru: Ок

# BUTTON_SELECTEDCHANGE
source: Edit selected
de: Ändern
ru: Изменить

# BUTTON_SELECTEDDELETE
source: Delete selected
de: Löschen
ru: Удалить

# BUTTON_SELECTPATH
source: Select
de: Weg
ru: Путь

# BUTTON_SHOWCUSTOM
source: Show custom
de: CustomNPC
ru: CustomNPC

# BUTTON_SHOWLOCAL
source: Show portraits
de: Porträts
ru: Портреты

# BUTTON_SUCESS
source: Sucess
de: Erfolgreich
ru: Успешно

# BUTTON_TOCREATE
source: Create
de: Erstellen
ru: Создать

# BUTTON_TOEXRACTPAGE
source: Extract folder
de: Ordner extrahieren
ru: Извлечь папку

# BUTTON_TOFILEPAGE
source: Create portrait
de: Erstellen Porträt
ru: Создать портрет

# BUTTON_TOGALLERYPAGE
source: Browse gallery
de: Galerie
ru: Галерея

# BUTTON_TOSCALEPAGE
source: Scale image
de: Zuschneiden
ru: Обрезать портрет

# BUTTON_TOSETTINGSPAGE
source: Settings
de: Einstellungen
ru: Настройки

# BUTTON_VALIDATE
source: Validate
de: Überprüfen
ru: Проверить

# BUTTON_YES
source: Yes
de: Ja
ru: Да

# HINT_EXTRACTPAGE
source: This is the extract page. Here you can copy all images from one folder to the game folder. Click "choose folder" to select a folder to copy. Select the images and click "extract selected" to move only certain images, or click "extract all" to move all available. To perform the process manually, click "open folders".
de: Dies ist die Seite zum Extrahieren von Ordnern. Hier können Sie alle Bilder aus einem beliebigen Ordner in den Spielordner kopieren. Klicken Sie auf die Schaltfläche „Ordner auswählen“, um einen Ordner zum Kopieren auszuwählen. Wählen Sie die Bilder aus und klicken Sie auf die Schaltfläche „Ausgewählte extrahieren“, um nur bestimmte Bilder zu verschieben, oder klicken Sie auf die Schaltfläche „Alle extrahieren“, um alle vorhandenen Porträts zu verschieben. Um den Vorgang manuell durchzuführen, klicken Sie auf die Schaltfläche „Ordner öffnen“.
ru: Это страница для извлечения папок. Здесь вы можете скопировать все изображения из любой папки в папку с игрой. Нажмите кнопку "выбрать папку", чтобы выбрать папку для копирования. Выберите изображения и нажмите кнопку "извлечь выбранные", чтобы переместить только определенные изображения, или нажмите кнопку "извлечь все", чтобы переместить все имеющиеся портреты. Для того, чтобы выполнить процесс вручную нажмите кнопку "открыть папки".

# HINT_FILEPAGE
source: This is the file page. Here you can choose which image to use as the portrait. You can upload a local image by clicking a button or image, or by simply dragging and dropping it onto the picture. Also, you can upload a web image by clicking the button and following instructions. Use change medium and change small buttons to replace the respective portraits.
de: Dies ist die Bildauswahlseite. Hier können Sie auswählen, welches Bild Sie als Porträt verwenden möchten. Sie können ein lokales Bild hochladen, indem Sie auf eine Schaltfläche oder ein Bild klicken oder es einfach auf das Bild ziehen. Sie können auch ein Webbild hochladen, indem Sie auf die Schaltfläche klicken und den Anweisungen folgen. Um die entsprechenden Porträts zu ersetzen, verwenden Sie die Schaltflächen „Mittleres Porträt“ und „Kleines Porträt“.
ru: Это страница выбора изображения. Здесь можно выбрать, какое изображение использовать в качестве портрета. Можно загрузить локальное изображение, щелкнув на кнопке или картинке, или просто перетащить его на рисунок. Также можно загрузить веб-изображение нажав на кнопку и следуя инструкциям. Для замены соответствующих портретов используйте кнопки "Средний портрет" и "Малый портрет".

# HINT_GALLERYPAGE
source: This is a gallery page that displays all the currently available portraits in the game. Select an image and click "edit selected" to copy/replace any portrait and create another one. You can also select multiple or individual images and click "delete" to remove them from the game folder.
de: Dies ist eine Galerieseite, die alle in das Spiel geladenen Porträts anzeigt. Wählen Sie ein Bild aus und klicken Sie auf die Schaltfläche „Bearbeiten“, um ein beliebiges Porträt zu kopieren/ersetzen und ein neues zu erstellen. Sie können auch mehrere Bilder oder einige davon auswählen und auf die Schaltfläche „Löschen“ klicken, um sie aus dem Spielordner zu entfernen. Wenn Sie CustomNPC installiert haben, klicken Sie oben auf die entsprechenden Schaltflächen, um die vom Mod gesteuerten Porträts anzuzeigen.
ru: Это страница галереи на которой отображаются все загруженные в игру портреты. Выберите изображение и нажмите кнопку "изменить", чтобы скопировать/заменить любой портрет и создать новый. Вы также можете выбрать несколько изображений или некоторые из них и нажать кнопку "удалить", чтобы удалить их из папки игры. Если у вас установлен CustomNPC, нажмите соответствующие кнопки в верхней части, чтобы отобразить портреты, управляемые модом.

# HINT_SCALEPAGE
source: This is a page for scaling and cropping the image to your liking. Use the mouse wheel to zoom images in and out. Double click the image to restore it to its original state. Drag the image to customize it. Click "create" to add a new portrait. The uploaded portraits will be almost exact copies of the images you framed on this page. Click "back" to return to the previous page.
de: Dies ist eine Seite zum Skalieren und Zuschneiden des Bildes nach Wunsch. Verwenden Sie das Mausrad zum Vergrößern oder Verkleinern. Doppelklicken Sie auf das Bild, um es in seinen ursprünglichen Zustand zurückzusetzen. Klicken Sie auf das Bild und ziehen Sie es, um es zu ändern. Klicken Sie auf die Schaltfläche „Erstellen“, um ein neues Porträt hinzuzufügen. Die von Ihnen hochgeladenen Porträts sind nahezu exakte Kopien der Bilder, die Sie auf dieser Seite gerahmt haben. Klicken Sie auf die Schaltfläche „Zurück“, um zur vorherigen Seite zurückzukehren.
ru: Это страница для масштабирования и обрезки изображения по усмотрению. Для увеличения или уменьшения масштаба изображения используйте колесико мыши. Дважды щелкните на изображении, чтобы вернуть его в исходное состояние. Нажмите и перетащите изображение, чтобы изменить его. Нажмите кнопку "Создать", чтобы добавить новый портрет. Загруженные портреты будут почти точными копиями изображений, которые вы поместили в рамках на этой странице. Нажмите кнопку "назад", чтобы вернуться на предыдущую страницу.

# INQR_DELETEOLD
source: Do you want to delete the old version of the portrait? Be advised that you are risking losing the portrait if you are to leave file page. Click "no" to create a copy. Or "yes" to replace the old portrait.
de: Möchten Sie die alte Version des Porträts löschen? Bitte beachten Sie, dass beim Verlassen der Bildauswahlseite das Risiko besteht, dass Ihr Porträt verloren geht. Klicken Sie auf „Nein“, um eine Kopie zu erstellen. Oder „Ja“, um das alte Porträt zu ersetzen.
ru: Вы хотите удалить старую версию портрета? Имейте в виду, что при выходе со страницы выбора изображения вы рискуете потерять портрет. Нажмите "нет", чтобы создать копию. Или "да", чтобы заменить старый портрет.

# INQR_NOIMAGECHOSEN
source: You have not uploaded any images. However, you can still use the default image. Click "yes" to continue with the default images. Click "no" to go back and choose another image.
de: Sie haben keine Bilder hochgeladen. Sie können jedoch das Standardbild verwenden. Klicken Sie auf „Ja“, um mit den Standardbildern fortzufahren. Klicken Sie auf „Nein“, um zurückzugehen und ein anderes Bild auszuwählen.
ru: Вы не загрузили ни одного изображения. Однако вы можете использовать изображение по умолчанию. Нажмите "да", чтобы продолжить работу с изображениями по умолчанию. Нажмите "нет", чтобы вернуться и выбрать другое изображение.

# LABEL_COPY
source: Artemii "Zeight" Saganenko© 2023
de: Artemii "Zeight" Saganenko© 2024
ru: Артемий "Zeight" Саганенко© 2024

# LABEL_CREATEDERROR
source: Something went wrong. Given that you have reached this stage, it is most likely a problem with the game directory. Check the existence and consistency of the directory shown above. Create it if necessary. Visit the settings page for more information.
de: Etwas ist schief gelaufen. Wenn Sie dieses Stadium erreicht haben, liegt das Problem höchstwahrscheinlich im Spielverzeichnis. Führen Sie das Spiel mindestens einmal aus. Überprüfen Sie die Verfügbarkeit des oben genannten Verzeichnisses. Erstellen Sie bei Bedarf eine. Weitere Informationen finden Sie auf der Seite „Einstellungen“. Wenn das Problem weiterhin besteht, schreiben Sie dem Autor auf Nexusmods.
ru: Что-то пошло не так. Если вы дошли до этого этапа, то, скорее всего, проблема заключается в каталоге игры. Запустите игру хотя бы один раз. Проверьте наличие указанного выше каталога. При необходимости создайте его. Для получения дополнительной информации посетите страницу настроек. Если проблема осталась напишите в автору на nexusmods.

# LABEL_CREATEDOK
source: The portrait was successfully created in the working directory, the location of which is indicated above. Now it is available for use in the game.
de: Das Porträt wurde erfolgreich im Arbeitsverzeichnis erstellt, dessen Speicherort oben angegeben ist. Es kann jetzt im Spiel verwendet werden. Ein gutes Spiel haben!
ru: Портрет был успешно создан в рабочем каталоге, расположение которого указано выше. Теперь он доступен для использования в игре. Приятной игры!

# LABEL_LARGEIMG
source: Large
de: Großes Porträt
ru: Большой портрет

# LABEL_LARGEIMG2
source: Character portrait
de: Charakterseite
ru: Страница персонажа

# LABEL_MEDIUMIMG
source: Medium
de: Mittleres Porträt
ru: Средний портрет

# LABEL_MEDIUMIMG2
source: Skills portrait
de: Fähigkeiten, Dialog
ru: Навыки, диалог

# LABEL_PATH
source: Path to the game portraits folder
de: Pfad zum Ordner „Porträts“.
ru: Путь к папке портретов

# LABEL_SETTINGS
source: This is the settings page. Here you can adjust the size by dragging the corner. And check the path to the correct portrait folder.
de: Dies ist die Einstellungsseite. Hier können Sie die Größe anpassen, indem Sie das Fenster um die Ecke ziehen. Und überprüfen Sie den Pfad zum gewünschten Ordner mit Porträts.
ru: Это страница настроек. Здесь можно настроить размер, перетащив окно за угол. И проверить путь к нужной папке с портретами.

# LABEL_SMALLIMG
source: Small
de: Kleines Porträt
ru: Малый портрет

# LABEL_SMALLIMG2
source: Gameplay portrait
de: Gameplay, Karte
ru: Геймплей, карта

# LABEL_URLDIALOG
source: Drag and drop, type, or copy the url of an existing image. The url address must lead to an accessible web-source.
de: Ziehen Sie die URL eines vorhandenen Bildes, geben Sie sie ein oder kopieren Sie sie. Die URL muss auf eine zugängliche Webquelle verweisen.
ru: Перетащите, введите или скопируйте url-адрес существующего изображения. Адрес url должен вести на доступный веб-источник.

# MESG_CANNOTLOAD
source: The selected web image is not available. Try another time, or just save it to your local drive and load it locally.
de: Das ausgewählte Webbild ist nicht verfügbar. Versuchen Sie es ein anderes Mal erneut oder speichern Sie es einfach auf Ihrem lokalen Laufwerk und laden Sie es lokal herunter. Bitte beachten Sie, dass das WEBP-Format nicht unterstützt wird.
ru: Выбранное веб-изображение недоступно. Попробуйте в другой раз или просто сохраните его на локальном диске и загрузите локально. Обратите внимание, что формат WEBP не поддерживается.

# MESG_DELETE
source: You are about to delete images. This process is irreversible. If your in-game portraits are in use, they will be replaced to placeholder by game itself. Do you want to continue? Total images:
de: Sie sind dabei, die Bilder zu löschen. Dieser Vorgang ist irreversibel! Wenn Ihre In-Game-Porträts verwendet werden, werden diese vom Spiel selbst durch normale Porträts ersetzt. Möchtest du fortfahren? Gesamtbilder:
ru: Вы собираетесь удалить изображения. Этот процесс необратим! Если ваши внутриигровые портреты используются, то они будут заменены на обычные самой игрой. Вы хотите продолжить? Всего изображений:

# MESG_GAMEFOLDERNOTFOUND
source: Game folder not found. Make sure you have launched the game at least once. If the issue persists, please report it in the bug section. If you need to control another game, be it Kingmaker or WotR. Change the game type in the settings or by clicking on the title image. Visit the settings page for more information. Until the problem is fixed, all functions will be blocked.
de: Der Spielordner wurde nicht gefunden. Stellen Sie sicher, dass Sie das Spiel mindestens einmal gestartet haben. Wenn das Problem weiterhin besteht, melden Sie es bitte im Abschnitt „Fehler“. Wenn Sie ein anderes Spiel verwalten müssen, sei es Kingmaker, WotR oder Rogue Trader. Ändern Sie den Spieltyp in den Einstellungen oder indem Sie auf das Titelbild klicken. Weitere Informationen finden Sie auf der Seite „Einstellungen“. Bis das Problem behoben ist, sind alle Funktionen gesperrt.
ru: Не найдена папка с игрой. Убедитесь, что вы запустили игру хотя бы один раз. Если проблема сохраняется, сообщите о ней в разделе ошибок. Если вам необходимо управлять другой игрой, будь то Kingmaker, WotR или Rogue Trader. Измените тип игры в настройках или щелкнув на заглавном изображении. Для получения дополнительной информации посетите страницу настроек. Пока проблема не будет устранена, все функции будут заблокированы.

# MESG_NONESELECTED
source: You have not selected any portrait. To edit or delete, select at least one image from the list.
de: Sie haben keine Porträts ausgewählt. Wählen Sie zum Bearbeiten oder Löschen mindestens ein Bild aus der Liste aus.
ru: Вы не выбрали ни одного портрета. Для редактирования или удаления выберите хотя бы одно изображение из списка.

# MESG_NONESELECTEDEXTRACT
source: You have not selected any portrait. To extract select at least one image from the list.
de: Sie haben keine Porträts ausgewählt. Wählen Sie zum Extrahieren mindestens ein Bild aus der Liste aus.
ru: Вы не выбрали ни одного портрета. Для извлечения выберите хотя бы одно изображение из списка.

# MESG_REPEATFOLDER
source: One or more folders already exist in the in-game portraits folder. The names are repeated. The program will rename the output folders so that the images are not overridden.
de: Im In-Game-Porträtordner sind bereits ein oder mehrere Ordner vorhanden. Ihre Namen werden wiederholt. Das Programm benennt die Ausgabeordner um, damit die Bilder nicht überschrieben werden.
ru: Одна или несколько папок уже существуют в папке с внутриигровыми портретами. Их имена повторяются. Программа переименует выходные папки так, чтобы изображения не были переопределены.

# MESG_SELECTEDMORE
source: More than one image selected. Only the first of all selected will be processed.
de: Es ist mehr als ein Bild ausgewählt. Es wird nur das erste aller ausgewählten Bilder verarbeitet.
ru: Выбрано более одного изображения. Будет обработано только первое из всех выбранных изображений.

# MESG_SUCCESS
source: Done! Images are loaded successfully:
de: Erledigt! Bilder erfolgreich hochgeladen:
ru: Выполнено! Изображения успешно загружены:

# MESG_WRONGFORMAT
source: The file is not in the correct format. Please select an image from the allowed formats. PNG, JPG, JPEG, BMP or GIF formats are allowed. The file may not be available as well. Directory should not be protected with extra rights.
de: Die Datei hat nicht das richtige Format. Bitte wählen Sie ein Bild aus den zulässigen Formaten aus. Akzeptierte Formate sind PNG, JPG, JPEG, BMP oder GIF. Möglicherweise ist die Datei auch nicht verfügbar. Das Verzeichnis sollte nicht durch zusätzliche Rechte geschützt werden! Versuchen Sie, das kyrillische Alphabet im Ordnerpfad zu vermeiden.
ru: Файл имеет неправильный формат. Пожалуйста, выберите изображение из разрешенных форматов. Допускаются форматы PNG, JPG, JPEG, BMP или GIF. Также файл может быть недоступен. Каталог не должен быть защищен дополнительными правами! Попробуйте избежать киррилицы в пути к папке.

# TEXTBOX_URL_INPUT
source: Input URL here
de: URL eingeben...
ru: Введите URL...

# TEXTBOX_URL_WRONG
source: Incorrect URL
de: Ungültige URL...
ru: Неверный URL...

# TEXT_FOLDEROPEN
source: Select folder to extract from
de: Wählen Sie den zu extrahierenden Ordner aus
ru: Выбрать папку для извлечения

# TEXT_IMAGEFILTER
source: All images
de: Alle Bilder
ru: Все изображения

# TEXT_PATHOPEN
source: Select folder which stores portraits
de: Wählen Sie den Ordner im Spiel aus
ru: Выберите внутриигровую папку

# TEXT_TITLEOPENFILE
source: Choose image
de: Bild
ru: Выберите изображение

# TEXT_TITLEOPENFOLDER
source: Choose folder
de: Ordner auswählen
ru: Выбрать папку
